"use strict"

/*
Задача №1
Що потрапить в консоль ?
*/

let someVar = 0;
++someVar;
if (someVar) {
  console.log(someVar);
}

/*
Відповідь: "В консоль потрапить 1"

  - Створюємо змінну і присвоюємо їй значення 0.
    - застосовуємо префіксний інкремент - змінна someVar збільшиться на одиницю(1)
      - Далі, перевіряємо умову - якщо someVar є "true"(в нашому випадку someVar = 1 буде "true"), виконується код, а саме вивід в консоль змінної someVar яка дорівнює 1.
*/


/*
Задача №2
За допомогою циклу FOR виведіть в консоль 10 рядків:
Пункт №1
Пункт №2
і т.д.
Відповідь №2:
*/

for (let i = 1; i <= 10; ++i) {
  console.log(`Пункт№ ${i}`)
}

/*
Цикл:
- створюємо змінну "i" і присвоюємо їй значення 1(старт циклу)
- умова циклу при якій він працює(поки "i" менше або дорівнює 10)
- виконується код в циклі(вивід в консоль(console.log) - текст і змінну "і"(значення змінної))
- після - префіксним інкрементом змінна "і" збільшується на 1
- так цикл повторюється поки "і" не стане більше ніж 10
- остання дія циклу - змінна "і" приймає значення 11, умова не виконується(i <= 10) і цикл завершує свою роботу
*/


/*
Задача №3
Що потрапить в консоль ?
*/

if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
  console.log('000');
}

else {
  console.log('false');
}


/*
Відповідь №3:

- 40 <= 10 || 15 < 5 && 10 <= "10" || 20 === "20"
  - false || false && true || false
  - false || false || false

Відповідь: false, умова не спрацює, тому в консоль, нічого не буде виведено.
*/

/*
  Задача №4
Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
Функція не має повертати NaN, Infinite або помилку

Відповідь №4:
*/

function calcDiv(a, b) {
  const result = a / b;
  if (result != 0 && result != undefined && result != Infinity && !isNaN(result)) {
    return console.log(`Результат ділення: ${result}`)
  }
  else {
    console.log(`Помилка`);
  }
}
calcDiv('6', 3)
calcDiv(Infinity, 3)
calcDiv(3)
calcDiv('r', 10)
calcDiv()
/*
- створюємо ф - ю, даємо назву, передаємо параметри
- створюємо змінну в якій міститься результат ділення  a / b
- якщо всі умови будуть виконані(true) - спрацює код, і буде виведений результат
- якщо хоча б одна умова не буде виконана(false) - код не спрацює (`Помилка`)
*/


/*
Задача №5
Створіть масив даних - 5 елементів, один з яких число 10
Обробіть масив за допомогою методу перебору
Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль
*/

// const array = ['масив', 10, 'Задача', '10', 8]
// for (let name of array) {
//   if (name === 10) {
//     console.log(name)
//   }
// }

/*
- створюємо масив
- обробляємо масив за допомогою циклу, перебираючи кожне значення масиву і перевіряємо чи виконується умова  name === 10, як що - так, то виводимо в консоль значення яке відповідає даній умові
*/
